''' 긴글
주석
입니다 '''

print("파이썬'만세!'" * 3)
print('파이썬"만세!"'* 3)
print(1.1)
print(3)
print(type("파이썬 만세"))
print(type(1.1))
print(type(3))


print(1, 2, -5, 3.14, 2.72342)
print('hi','python')

print('23000원은','5000원 ?개','1000원 ?개')
print('5000원',23000//5000,'개')
print('1000원',(23000 % 5000)// 1000,'개')

print(1 + 62 - 3 * 52)
print(eval('1+62-3*52'))
print(256 * 553 - 152)
print(765431245 % 876543 , 765431245 // 876543)

print('5만원권', 78000 // 50000, '장')
a = 78000 // 50000
print('1만원권', 28000 // 10000, '장')
b = 28000 // 10000
print('5천원권', 8000 // 5000 , '장')
c = 8000 // 5000
print('1천원권', 3000 // 1000 , '장')
d = 3000 // 1000

print('내야 하는 지폐의 장 수 = ', a + b + c + d,'장')
